import pandas as pd
df = pd.read_csv('GooglePlayStore_wild.csv')


#print(pd.isnull(df)["Rating"])
#print(df[pd.isnull(df)]["Rating"].head(2))

#df.fillna({"Rating": df["Rating"].value_counts().index(0)}, inplace = True)
df.fillna({"Rating": round(df["Rating"].mean(), 1)}, inplace = True)
print(df["Rating"].mean())


a = "$5.5"
a = float(a[1:])

def change_price(a):
    if a[0] == "$":
        return float(a[1:])
    return 0

df["Price"] = df["Price"].apply(change_price)

df.info()






















# Виведи інформацію про всі DataFrame, щоб дізнатися, які стовпці потребують очищення
# Скільки в датасеті додатків, у яких не вказано (NaN) рейтинг (Rating)?

# Заміни порожнє значення ('NaN') рейтингу ('Rating') для таких програм на -1.

# Визнач, яке ще значення розміру ('Size') зберігається в датасеті крім Кілобайтів та Мегабайтів, заміни його на -1.
# Перетвори розміри додатків ('Size') у числовий формат (float). Розмір усіх програм повинен вимірюватися в Мегабайтах.

# Чому дорівнює максимальний розмір ('Size') додатків з категорії ('Category') 'TOOLS'?

# Бонусні завдання
# Заміни тип даних на цілий (int) для кількості установок ('Installs').
# У записі кількості установок ('Installs') знак "+" необхідно ігнорувати.
# Тобто, якщо в датасеті кількість установок дорівнює 1,000,000+, необхідно змінити значення на 1000000

# Згрупуй дані за категорією ('Category') та цільовою аудиторією ('Content Rating') будь-яким зручним для тебе способом,
# Порахуй середню кількість установок ('Installs') у кожній групі. Результат округлили до десятих.
# В отриманій таблиці знайди клітинку з найбільшим значенням.
# До якої вікової групи та типу додатків відносяться дані з цієї клітинки?

# У якої програми не вказаний тип ('Type')? Який тип там потрібно записати залежно від ціни?

# Виведи інформацію про все DataFrame, щоб переконатися, що очищення пройшло успішно